note/drawio/converted/dot/260506-sr04-parallel-ver-asm.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_enB7lwsSKnQhAznJWjNS_1" [label="node_WjNS-1"];
  "n_enB7lwsSKnQhAznJWjNS_10" [label="trig = 1"];
  "n_enB7lwsSKnQhAznJWjNS_11" [label="node_jNS-11"];
  "n_enB7lwsSKnQhAznJWjNS_12" [label="node_jNS-12"];
  "n_enB7lwsSKnQhAznJWjNS_13" [label="tick_us == 1"];
  "n_enB7lwsSKnQhAznJWjNS_14" [label="tick_cnt +1"];
  "n_enB7lwsSKnQhAznJWjNS_15" [label="node_jNS-15"];
  "n_enB7lwsSKnQhAznJWjNS_16" [label="tick_cnt >= 11"];
  "n_enB7lwsSKnQhAznJWjNS_2" [label="IDLE"];
  "n_enB7lwsSKnQhAznJWjNS_24" [label="node_jNS-24"];
  "n_enB7lwsSKnQhAznJWjNS_25" [label="WAIT"];
  "n_enB7lwsSKnQhAznJWjNS_26" [label="trig =0"];
  "n_enB7lwsSKnQhAznJWjNS_27" [label="node_jNS-27"];
  "n_enB7lwsSKnQhAznJWjNS_28" [label="tick_us == 1"];
  "n_enB7lwsSKnQhAznJWjNS_30" [label="node_jNS-30"];
  "n_enB7lwsSKnQhAznJWjNS_31" [label="echo ==1"];
  "n_enB7lwsSKnQhAznJWjNS_32" [label="tick_cnt = 0"];
  "n_enB7lwsSKnQhAznJWjNS_37" [label="node_jNS-37"];
  "n_enB7lwsSKnQhAznJWjNS_38" [label="Respose"];
  "n_enB7lwsSKnQhAznJWjNS_39" [label="tick_us == 1"];
  "n_enB7lwsSKnQhAznJWjNS_40" [label="node_jNS-40"];
  "n_enB7lwsSKnQhAznJWjNS_41" [label="tick_cnt ++"];
  "n_enB7lwsSKnQhAznJWjNS_42" [label="node_jNS-42"];
  "n_enB7lwsSKnQhAznJWjNS_43" [label="echo ==0"];
  "n_enB7lwsSKnQhAznJWjNS_44" [label="node_jNS-44"];
  "n_enB7lwsSKnQhAznJWjNS_45" [label="tick_cnt /58"];
  "n_enB7lwsSKnQhAznJWjNS_5" [label="trig =0"];
  "n_enB7lwsSKnQhAznJWjNS_52" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_53" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_54" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_56" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_58" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_6" [label="node_WjNS-6"];
  "n_enB7lwsSKnQhAznJWjNS_60" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_62" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_65" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_69" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_7" [label="sr04_start == 1"];
  "n_enB7lwsSKnQhAznJWjNS_70" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_8" [label="node_WjNS-8"];
  "n_enB7lwsSKnQhAznJWjNS_9" [label="START"];
  "n_enB7lwsSKnQhAznJWjNS_5" -> "n_enB7lwsSKnQhAznJWjNS_6";
  "n_enB7lwsSKnQhAznJWjNS_6" -> "n_enB7lwsSKnQhAznJWjNS_8";
  "n_enB7lwsSKnQhAznJWjNS_6" -> "n_enB7lwsSKnQhAznJWjNS_1";
  "n_enB7lwsSKnQhAznJWjNS_8" -> "n_enB7lwsSKnQhAznJWjNS_11";
  "n_enB7lwsSKnQhAznJWjNS_11" -> "n_enB7lwsSKnQhAznJWjNS_12";
  "n_enB7lwsSKnQhAznJWjNS_12" -> "n_enB7lwsSKnQhAznJWjNS_14";
  "n_enB7lwsSKnQhAznJWjNS_14" -> "n_enB7lwsSKnQhAznJWjNS_15";
  "n_enB7lwsSKnQhAznJWjNS_15" -> "n_enB7lwsSKnQhAznJWjNS_24";
  "n_enB7lwsSKnQhAznJWjNS_24" -> "n_enB7lwsSKnQhAznJWjNS_26";
  "n_enB7lwsSKnQhAznJWjNS_26" -> "n_enB7lwsSKnQhAznJWjNS_27";
  "n_enB7lwsSKnQhAznJWjNS_27" -> "n_enB7lwsSKnQhAznJWjNS_30";
  "n_enB7lwsSKnQhAznJWjNS_32" -> "n_enB7lwsSKnQhAznJWjNS_37";
  "n_enB7lwsSKnQhAznJWjNS_30" -> "n_enB7lwsSKnQhAznJWjNS_32";
  "n_enB7lwsSKnQhAznJWjNS_37" -> "n_enB7lwsSKnQhAznJWjNS_39";
  "n_enB7lwsSKnQhAznJWjNS_39" -> "n_enB7lwsSKnQhAznJWjNS_41";
  "n_enB7lwsSKnQhAznJWjNS_41" -> "n_enB7lwsSKnQhAznJWjNS_42";
  "n_enB7lwsSKnQhAznJWjNS_42" -> "n_enB7lwsSKnQhAznJWjNS_45";
  "n_enB7lwsSKnQhAznJWjNS_44" -> "n_enB7lwsSKnQhAznJWjNS_1";
}
